Documents/ЗаказНаСклад.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>ЗаказНаСклад</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиНаСкладе</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ПозицииЛекарств</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Лекарство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лекарства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ОстаткиНаСкладе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиНаСкладе</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Лекарство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лекарства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ЗаказНаСклад/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОстаткиНаСкладе Приход
	Движения.ОстаткиНаСкладе.Записывать = Истина;
	Для Каждого ТекСтрокаПозицииЛекарств Из ПозицииЛекарств Цикл
		Движение = Движения.ОстаткиНаСкладе.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Лекарство = ТекСтрокаПозицииЛекарств.Лекарство;
		Движение.Количество = ТекСтрокаПозицииЛекарств.Количество;
	КонецЦикла;

КонецПроцедуры

 Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
УникальныеЗаписи = Новый Соответствие();
Для Каждого ТекСтрока Из ПозицииЛекарств Цикл
		Если УникальныеЗаписи.Получить(ТекСтрока.Лекарство) <> Неопределено Тогда
		Отказ = Истина;
		Сообщить("Лекарство '" + ТекСтрока.Лекарство + "' уже существует в документе.");
	Прервать;
	КонецЕсли;
		УникальныеЗаписи.Вставить(ТекСтрока.Лекарство, Истина);
	КонецЦикла;


	Если ЭтотОбъект.ПозицииЛекарств.Количество() = 0 Тогда
	Отказ = Истина;
	Сообщить("Запись не может быть пустой.");
Возврат;
КонецЕсли;
КонецПроцедуры
